#include "Global.h"

//Использовать для некоторых важных параметрах не попадающих в модульные функции
//Пока пусто, потому что все раскидано по модулям:
//#include "LoadTGA.h"//(LoadTGA.cpp) Загрузка текстур файлов TGA
//#include "LoadBMP.h"//(LoadBMP.cpp) Загрузка текстур файлов BMP
////#include "LoadBMP2.h"//(LoadBMP2.cpp) Загрузка текстур файлов BMP (на стадии тестирования-не рабочая)
//#include "Font.h"//(Font.cpp) Шрифты
//#include "OpenGL.h"//(OpenGL.cpp) Функции OpenGL для трехмерной графики
//#include "ViborObyekt.h"//(ViborObyekt.cpp) Функции для определения объектов в трехмерном пространстве
//#include "StartActive.h"//(StartActive.cpp) Для вызова методов после создания окна программы, загрузка текстуры и настроек
//#include "WinAPIOkno.h"//(WinAPIOkno.cpp) Создание и обработка окна программы
//#include "SobytiaEvents.h"//(SobytiaEvents.cpp) Обработчик событий


////////////////////////////
//Сбор переменных///////////
////////////////////////////


//////////////////////////////
//Сбор методов////////////////
//////////////////////////////





